Revit 2027 API
FabricationConfigurationInfo.FindSourceFabricationConfiguration Method
 Finds the source fabrication configuration on disk which matches the input fabrication configuration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FabricationConfigurationInfo FindSourceFabricationConfiguration(
	FabricationConfigurationInfo fabricationConfiguration
)
Public Shared Function FindSourceFabricationConfiguration (
	fabricationConfiguration As FabricationConfigurationInfo
) As FabricationConfigurationInfo
public:
static FabricationConfigurationInfo^ FindSourceFabricationConfiguration(
	FabricationConfigurationInfo^ fabricationConfiguration
)
static member FindSourceFabricationConfiguration :
        fabricationConfiguration : FabricationConfigurationInfo -> FabricationConfigurationInfo
Parameters
fabricationConfiguration FabricationConfigurationInfo
 The fabrication configuration to match.
Return Value
FabricationConfigurationInfo
 The matching source fabrication configuration.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Fabrication configuration is matched by configuration GUID and version. The GUIDs are required to be the same. For version, we first try to match the version exactly. If Revit cannot find an exact match, then it looks for the closest version later than the input configuration, then the closest earlier version.
See Also
Reference
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace